{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/jpmvbastos/Documents/GitHub/ColonialLegacy/Results/Review/sensitivity.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}30 Jan 2025, 17:09:29
{txt}
{com}. 
. 
. **** TABLE 3
. 
. global w1 "america africa asia lat_abst landlock island"
{txt}
{com}. 
. global model3 "ruggedness logem4 lpd1500s humid* temp* steplow  deslow stepmid desmid drystep hiland drywint goldm iron silv zinc oilres i.colonizer"
{txt}
{com}. 
. global model4 "ruggedness logem4 lpd1500s humid* temp* steplow  deslow stepmid desmid  drystep hiland drywint goldm iron silv zinc oilres legor_fr legor_uk i.colonizer"
{txt}
{com}. 
. * Oster (2019)
. regsensitivity breakdown avg_efw efw_colonizer $w1 $model3, compare($w1) /// 
>         oster rlong(1.3, relative) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: Oster (2019){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=       0.036
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       1.199
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.000
{col 48}{txt}R2(medium){col 67}{res}=       0.438
{col 48}{txt}Var(Y){col 67}{res}=       0.355
{col 48}{txt}Var(X){col 67}{res}=       0.016
{txt}Hypothesis{col 18}{res}: Beta != 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.011
{txt}Other Params{col 18}{res}: R-squared(long) = 1
{hline 80}
{col 2}{txt}Beta(Hypothesis){col 37}Delta(Breakdown)
{hline 80}
{col 2}{res}0.000               {col 37}68.5 %
{hline 80}
{txt}
{com}. regsensitivity breakdown avg_efw efw_colonizer $w1 $model4, compare($w1) /// 
>         oster rlong(1.3, relative) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: Oster (2019){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=       0.397
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       1.648
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.008
{col 48}{txt}R2(medium){col 67}{res}=       0.487
{col 48}{txt}Var(Y){col 67}{res}=       0.306
{col 48}{txt}Var(X){col 67}{res}=       0.016
{txt}Hypothesis{col 18}{res}: Beta != 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.010
{txt}Other Params{col 18}{res}: R-squared(long) = 1
{hline 80}
{col 2}{txt}Beta(Hypothesis){col 37}Delta(Breakdown)
{hline 80}
{col 2}{res}0.000               {col 37}105.4%
{hline 80}
{txt}
{com}.         
. *-- DMP (2022)
. * 1) Rybar = + inf, c=(0.25, 0.5, 0.75, 1)
. regsensitivity breakdown avg_efw efw_colonizer $w1 $model3, cbar(0.25(0.25)1) ///
>         compare($w1) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=       0.036
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       1.199
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.000
{col 48}{txt}R2(medium){col 67}{res}=       0.438
{col 48}{txt}Var(Y){col 67}{res}=       0.355
{col 48}{txt}Var(X){col 67}{res}=       0.016
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.011

{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}0.250               {col 37}33.9 %
{col 2}0.500               {col 37}33.7 %
{col 2}0.750               {col 37}33.7 %
{col 2}1.000               {col 37}33.7 %
{hline 80}
{txt}
{com}. regsensitivity breakdown avg_efw efw_colonizer $w1 $model4, cbar(0.25(0.25)1) ///
>         compare($w1) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=       0.397
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       1.648
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.008
{col 48}{txt}R2(medium){col 67}{res}=       0.487
{col 48}{txt}Var(Y){col 67}{res}=       0.306
{col 48}{txt}Var(X){col 67}{res}=       0.016
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.010

{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}0.250               {col 37}47.1 %
{col 2}0.500               {col 37}45.9 %
{col 2}0.750               {col 37}45.9 %
{col 2}1.000               {col 37}45.9 %
{hline 80}
{txt}
{com}. 
. * 2) Rybar = Rxbar, c=1
. regsensitivity breakdown avg_efw efw_colonizer $w1 $model3, rybar(=rxbar) ///
>         compare($w1) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=       0.036
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       1.199
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.000
{col 48}{txt}R2(medium){col 67}{res}=       0.438
{col 48}{txt}Var(Y){col 67}{res}=       0.355
{col 48}{txt}Var(X){col 67}{res}=       0.016
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.011
{txt}Other Params{col 18}{res}: rybar = rxbar
{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}1.000               {col 37}61.4 %
{hline 80}
{txt}
{com}. regsensitivity breakdown avg_efw efw_colonizer $w1 $model4, rybar(=rxbar) ///
>         compare($w1) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=       0.397
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       1.648
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.008
{col 48}{txt}R2(medium){col 67}{res}=       0.487
{col 48}{txt}Var(Y){col 67}{res}=       0.306
{col 48}{txt}Var(X){col 67}{res}=       0.016
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.010
{txt}Other Params{col 18}{res}: rybar = rxbar
{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}1.000               {col 37}70.2 %
{hline 80}
{txt}
{com}.         
.         
. **** TABLE 4 - Timing and Alternative Measures
. 
. global baseline "ruggedness lpd1500s"
{txt}
{com}. 
. gen postwar_int = postwar*hiel_indep
{txt}(20 missing values generated)

{com}. 
. * Oster (2019)
. * Postwar 
. regsensitivity breakdown avg_efw postwar $w1 $baseline i.colonizer_indep, compare($w1) ///  Column 4
>         oster rlong(1.3, relative) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: Oster (2019){col 48}{txt}Number of obs{col 67}{res}=          66
{col 48}{txt}Beta(short){col 67}{res}=      -0.456
{txt}Treatment{col 18}{res}: postwar{col 48}{txt}Beta(medium){col 67}{res}=      -0.451
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.031
{col 48}{txt}R2(medium){col 67}{res}=       0.340
{col 48}{txt}Var(Y){col 67}{res}=       0.576
{col 48}{txt}Var(X){col 67}{res}=       0.086
{txt}Hypothesis{col 18}{res}: Beta != 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.059
{txt}Other Params{col 18}{res}: R-squared(long) = 1
{hline 80}
{col 2}{txt}Beta(Hypothesis){col 37}Delta(Breakdown)
{hline 80}
{col 2}{res}0.000               {col 37}97.7 %
{hline 80}
{txt}
{com}. * HIEL Indep. X Postwar
. regsensitivity breakdown avg_efw postwar_int postwar hiel_indep $w1 $baseline /// Column 5
>         i.colonizer_indep, compare($w1) oster rlong(1.3, relative) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: Oster (2019){col 48}{txt}Number of obs{col 67}{res}=          66
{col 48}{txt}Beta(short){col 67}{res}=      -0.179
{txt}Treatment{col 18}{res}: postwar_int{col 48}{txt}Beta(medium){col 67}{res}=       0.117
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.002
{col 48}{txt}R2(medium){col 67}{res}=       0.323
{col 48}{txt}Var(Y){col 67}{res}=       0.558
{col 48}{txt}Var(X){col 67}{res}=       0.039
{txt}Hypothesis{col 18}{res}: Beta != 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.027
{txt}Other Params{col 18}{res}: R-squared(long) = 1
{hline 80}
{col 2}{txt}Beta(Hypothesis){col 37}Delta(Breakdown)
{hline 80}
{col 2}{res}0.000               {col 37}14.9 %
{hline 80}
{txt}
{com}.         
. *-- DMP (2022)
. * 1) Rybar = + inf, c=(0.25, 0.5, 0.75, 1)
. regsensitivity breakdown avg_efw postwar $w1 $baseline i.colonizer_indep, cbar(0.25(0.25)1) /// Column 4
>         compare($w1) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          66
{col 48}{txt}Beta(short){col 67}{res}=      -0.456
{txt}Treatment{col 18}{res}: postwar{col 48}{txt}Beta(medium){col 67}{res}=      -0.451
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.031
{col 48}{txt}R2(medium){col 67}{res}=       0.340
{col 48}{txt}Var(Y){col 67}{res}=       0.576
{col 48}{txt}Var(X){col 67}{res}=       0.086
{txt}Hypothesis{col 18}{res}: Beta < 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.059

{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}0.250               {col 37}24.8 %
{col 2}0.500               {col 37}24.8 %
{col 2}0.750               {col 37}24.8 %
{col 2}1.000               {col 37}24.8 %
{hline 80}
{txt}
{com}. regsensitivity breakdown avg_efw postwar_int postwar hiel_indep $w1 $baseline /// Column 5
>         i.colonizer_indep, cbar(0.25(0.25)1) compare($w1) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          66
{col 48}{txt}Beta(short){col 67}{res}=      -0.179
{txt}Treatment{col 18}{res}: postwar_int{col 48}{txt}Beta(medium){col 67}{res}=       0.117
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.002
{col 48}{txt}R2(medium){col 67}{res}=       0.323
{col 48}{txt}Var(Y){col 67}{res}=       0.558
{col 48}{txt}Var(X){col 67}{res}=       0.039
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.027

{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}0.250               {col 37}4.7  %
{col 2}0.500               {col 37}4.7  %
{col 2}0.750               {col 37}4.7  %
{col 2}1.000               {col 37}4.7  %
{hline 80}
{txt}
{com}.         
.         
. **** TABLE 5 - Euro Settlers / Origins
. 
. global baseline "ruggedness lpd1500s"
{txt}
{com}. 
. gen share_euro2 = share_euro
{txt}(1 missing value generated)

{com}. replace share_euro2 = .2743236 if country=="Barbados" | country=="Bahamas"
{txt}(2 real changes made)

{com}. replace share_euro2 = .9736003 if country=="New Zealand"
{txt}(1 real change made)

{com}. 
. foreach v in euro_share share_euro share_euro2 {c -(}
{txt}  2{com}.         replace `v' = `v' * 100
{txt}  3{com}. {c )-}
{txt}(58 real changes made)
(42 real changes made)
(45 real changes made)

{com}. 
. gen hiel_euro_share = efw_colonizer * euro_share
{txt}(67 missing values generated)

{com}. gen hiel_share_euro = efw_colonizer * share_euro
{txt}(21 missing values generated)

{com}. gen hiel_share_euro2 = efw_colonizer * share_euro2
{txt}(21 missing values generated)

{com}. 
. *** Panel A:
. 
. ** Oster (2019)
. 
. * Avg. HIEL
. regsensitivity breakdown avg_efw efw_colonizer euro_share $w1 $baseline, compare($w1) ///  Column 2
>         oster rlong(1.3, relative) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: Oster (2019){col 48}{txt}Number of obs{col 67}{res}=          37
{col 48}{txt}Beta(short){col 67}{res}=       0.371
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       0.337
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.087
{col 48}{txt}R2(medium){col 67}{res}=       0.406
{col 48}{txt}Var(Y){col 67}{res}=       0.434
{col 48}{txt}Var(X){col 67}{res}=       0.274
{txt}Hypothesis{col 18}{res}: Beta != 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.190
{txt}Other Params{col 18}{res}: R-squared(long) = 1
{hline 80}
{col 2}{txt}Beta(Hypothesis){col 37}Delta(Breakdown)
{hline 80}
{col 2}{res}0.000               {col 37}94.2 %
{hline 80}
{txt}
{com}.         
. * Euro Share
. regsensitivity breakdown avg_efw euro_share efw_colonizer $w1 $baseline, compare($w1) ///  Column 2
>         oster rlong(1.3, relative) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: Oster (2019){col 48}{txt}Number of obs{col 67}{res}=          37
{col 48}{txt}Beta(short){col 67}{res}=       0.019
{txt}Treatment{col 18}{res}: euro_share{col 48}{txt}Beta(medium){col 67}{res}=       0.011
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.222
{col 48}{txt}R2(medium){col 67}{res}=       0.494
{col 48}{txt}Var(Y){col 67}{res}=       0.510
{col 48}{txt}Var(X){col 67}{res}=     317.683
{txt}Hypothesis{col 18}{res}: Beta != 0         {col 48}{txt}Var(X_Residual){col 67}{res}=     104.972
{txt}Other Params{col 18}{res}: R-squared(long) = 1
{hline 80}
{col 2}{txt}Beta(Hypothesis){col 37}Delta(Breakdown)
{hline 80}
{col 2}{res}0.000               {col 37}20.7 %
{hline 80}
{txt}
{com}.         
.         
. *-- DMP (2022)
. * 1) Rybar = + inf, c=(0.25, 0.5, 0.75, 1)
. 
. * Avg. HIEL
. regsensitivity breakdown avg_efw efw_colonizer euro_share $w1 $baseline, compare($w1) ///  Column 2
>          cbar(0.25(0.25)1) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          37
{col 48}{txt}Beta(short){col 67}{res}=       0.371
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       0.337
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.087
{col 48}{txt}R2(medium){col 67}{res}=       0.406
{col 48}{txt}Var(Y){col 67}{res}=       0.434
{col 48}{txt}Var(X){col 67}{res}=       0.274
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.190

{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}0.250               {col 37}38.9 %
{col 2}0.500               {col 37}38.5 %
{col 2}0.750               {col 37}38.5 %
{col 2}1.000               {col 37}38.5 %
{hline 80}
{txt}
{com}.         
. * Euro Share
. regsensitivity breakdown avg_efw euro_share efw_colonizer $w1 $baseline, compare($w1) ///  Column 2
>          cbar(0.25(0.25)1)
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          37
{col 48}{txt}Beta(short){col 67}{res}=       0.019
{txt}Treatment{col 18}{res}: euro_share{col 48}{txt}Beta(medium){col 67}{res}=       0.011
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.222
{col 48}{txt}R2(medium){col 67}{res}=       0.494
{col 48}{txt}Var(Y){col 67}{res}=       0.510
{col 48}{txt}Var(X){col 67}{res}=     317.683
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=     104.972

{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}0.250               {col 37}14.8 %
{col 2}0.500               {col 37}14.8 %
{col 2}0.750               {col 37}14.8 %
{col 2}1.000               {col 37}14.8 %
{hline 80}
{txt}
{com}. 
.          
. * Panel B: Share Euro
. 
. ** Oster (2019)
. 
. * Avg. HIEL
. regsensitivity breakdown avg_efw efw_colonizer share_euro $w1 $baseline, compare($w1) ///  Column 2
>         oster rlong(1.3, relative) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: Oster (2019){col 48}{txt}Number of obs{col 67}{res}=          66
{col 48}{txt}Beta(short){col 67}{res}=       0.614
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       0.446
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.141
{col 48}{txt}R2(medium){col 67}{res}=       0.350
{col 48}{txt}Var(Y){col 67}{res}=       0.657
{col 48}{txt}Var(X){col 67}{res}=       0.246
{txt}Hypothesis{col 18}{res}: Beta != 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.210
{txt}Other Params{col 18}{res}: R-squared(long) = 1
{hline 80}
{col 2}{txt}Beta(Hypothesis){col 37}Delta(Breakdown)
{hline 80}
{col 2}{res}0.000               {col 37}65.9 %
{hline 80}
{txt}
{com}.         
. regsensitivity breakdown avg_efw efw_colonizer share_euro $w1 $model4, compare($w1) ///  Column 3
>         oster rlong(1.3, relative) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: Oster (2019){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=       0.318
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       1.442
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.006
{col 48}{txt}R2(medium){col 67}{res}=       0.574
{col 48}{txt}Var(Y){col 67}{res}=       0.272
{col 48}{txt}Var(X){col 67}{res}=       0.016
{txt}Hypothesis{col 18}{res}: Beta != 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.010
{txt}Other Params{col 18}{res}: R-squared(long) = 1
{hline 80}
{col 2}{txt}Beta(Hypothesis){col 37}Delta(Breakdown)
{hline 80}
{col 2}{res}0.000               {col 37}151.2%
{hline 80}
{txt}
{com}.         
. regsensitivity breakdown avg_efw efw_colonizer share_euro hiel_share_euro $w1 $baseline, compare($w1) ///  Column 5
>         oster rlong(1.3, relative) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: Oster (2019){col 48}{txt}Number of obs{col 67}{res}=          66
{col 48}{txt}Beta(short){col 67}{res}=       0.613
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       0.448
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.140
{col 48}{txt}R2(medium){col 67}{res}=       0.350
{col 48}{txt}Var(Y){col 67}{res}=       0.656
{col 48}{txt}Var(X){col 67}{res}=       0.245
{txt}Hypothesis{col 18}{res}: Beta != 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.210
{txt}Other Params{col 18}{res}: R-squared(long) = 1
{hline 80}
{col 2}{txt}Beta(Hypothesis){col 37}Delta(Breakdown)
{hline 80}
{col 2}{res}0.000               {col 37}66.8 %
{hline 80}
{txt}
{com}.         
. regsensitivity breakdown avg_efw efw_colonizer share_euro hiel_share_euro $w1 $model4, compare($w1) ///  Column 6
>         oster rlong(1.3, relative) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: Oster (2019){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=       0.305
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       1.344
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.005
{col 48}{txt}R2(medium){col 67}{res}=       0.618
{col 48}{txt}Var(Y){col 67}{res}=       0.270
{col 48}{txt}Var(X){col 67}{res}=       0.016
{txt}Hypothesis{col 18}{res}: Beta != 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.010
{txt}Other Params{col 18}{res}: R-squared(long) = 1
{hline 80}
{col 2}{txt}Beta(Hypothesis){col 37}Delta(Breakdown)
{hline 80}
{col 2}{res}0.000               {col 37}191.9%
{hline 80}
{txt}
{com}.         
. * Euro Origins  
. regsensitivity breakdown avg_efw share_euro efw_colonizer hiel_share_euro $w1 $model4, compare($w1) ///  Column 6
>         oster rlong(1.3, relative) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: Oster (2019){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=       0.364
{txt}Treatment{col 18}{res}: share_euro{col 48}{txt}Beta(medium){col 67}{res}=      -1.344
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.006
{col 48}{txt}R2(medium){col 67}{res}=       0.618
{col 48}{txt}Var(Y){col 67}{res}=       0.270
{col 48}{txt}Var(X){col 67}{res}=       0.012
{txt}Hypothesis{col 18}{res}: Beta != 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.007
{txt}Other Params{col 18}{res}: R-squared(long) = 1
{hline 80}
{col 2}{txt}Beta(Hypothesis){col 37}Delta(Breakdown)
{hline 80}
{col 2}{res}0.000               {col 37}90.9 %
{hline 80}
{txt}
{com}.         
. * Avg. HIEL X Euro Origins 
.         
. regsensitivity breakdown avg_efw hiel_share_euro share_euro efw_colonizer $w1 $model4, compare($w1) ///  Column 6
>         oster rlong(1.3, relative) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: Oster (2019){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=      -0.047
{txt}Treatment{col 18}{res}: hiel_share_euro{col 48}{txt}Beta(medium){col 67}{res}=       0.167
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.006
{col 48}{txt}R2(medium){col 67}{res}=       0.619
{col 48}{txt}Var(Y){col 67}{res}=       0.270
{col 48}{txt}Var(X){col 67}{res}=       0.771
{txt}Hypothesis{col 18}{res}: Beta != 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.459
{txt}Other Params{col 18}{res}: R-squared(long) = 1
{hline 80}
{col 2}{txt}Beta(Hypothesis){col 37}Delta(Breakdown)
{hline 80}
{col 2}{res}0.000               {col 37}90.1 %
{hline 80}
{txt}
{com}.         
.         
. *-- DMP (2022)
. * 1) Rybar = + inf, c=(0.25, 0.5, 0.75, 1)
. 
. * Avg. HIEL
. regsensitivity breakdown avg_efw efw_colonizer share_euro $w1 $baseline, compare($w1) ///  Column 2
>          cbar(0.25(0.25)1) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          66
{col 48}{txt}Beta(short){col 67}{res}=       0.614
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       0.446
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.141
{col 48}{txt}R2(medium){col 67}{res}=       0.350
{col 48}{txt}Var(Y){col 67}{res}=       0.657
{col 48}{txt}Var(X){col 67}{res}=       0.246
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.210

{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}0.250               {col 37}63.2 %
{col 2}0.500               {col 37}59.1 %
{col 2}0.750               {col 37}58.8 %
{col 2}1.000               {col 37}58.8 %
{hline 80}
{txt}
{com}.         
. regsensitivity breakdown avg_efw efw_colonizer share_euro $w1 $model4, compare($w1) ///  Column 3
>          cbar(0.25(0.25)1) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=       0.318
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       1.442
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.006
{col 48}{txt}R2(medium){col 67}{res}=       0.574
{col 48}{txt}Var(Y){col 67}{res}=       0.272
{col 48}{txt}Var(X){col 67}{res}=       0.016
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.010

{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}0.250               {col 37}47.1 %
{col 2}0.500               {col 37}45.9 %
{col 2}0.750               {col 37}45.9 %
{col 2}1.000               {col 37}45.9 %
{hline 80}
{txt}
{com}.          
. regsensitivity breakdown avg_efw efw_colonizer share_euro hiel_share_euro $w1 $baseline, compare($w1) ///  Column 5
>         cbar(0.25(0.25)1) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          66
{col 48}{txt}Beta(short){col 67}{res}=       0.613
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       0.448
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.140
{col 48}{txt}R2(medium){col 67}{res}=       0.350
{col 48}{txt}Var(Y){col 67}{res}=       0.656
{col 48}{txt}Var(X){col 67}{res}=       0.245
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.210

{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}0.250               {col 37}63.3 %
{col 2}0.500               {col 37}59.2 %
{col 2}0.750               {col 37}58.9 %
{col 2}1.000               {col 37}58.9 %
{hline 80}
{txt}
{com}.         
. regsensitivity breakdown avg_efw efw_colonizer share_euro hiel_share_euro $w1 $model4, compare($w1) ///  Column 6
>         cbar(0.25(0.25)1) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=       0.305
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       1.344
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.005
{col 48}{txt}R2(medium){col 67}{res}=       0.618
{col 48}{txt}Var(Y){col 67}{res}=       0.270
{col 48}{txt}Var(X){col 67}{res}=       0.016
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.010

{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}0.250               {col 37}46.3 %
{col 2}0.500               {col 37}45.2 %
{col 2}0.750               {col 37}45.2 %
{col 2}1.000               {col 37}45.2 %
{hline 80}
{txt}
{com}.         
. * Euro Origins 
.         
. regsensitivity breakdown avg_efw share_euro efw_colonizer hiel_share_euro $w1 $model4, compare($w1) ///  Column 6
>         cbar(0.25(0.25)1) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=       0.364
{txt}Treatment{col 18}{res}: share_euro{col 48}{txt}Beta(medium){col 67}{res}=      -1.344
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.006
{col 48}{txt}R2(medium){col 67}{res}=       0.618
{col 48}{txt}Var(Y){col 67}{res}=       0.270
{col 48}{txt}Var(X){col 67}{res}=       0.012
{txt}Hypothesis{col 18}{res}: Beta < 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.007

{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}0.250               {col 37}37.9 %
{col 2}0.500               {col 37}37.6 %
{col 2}0.750               {col 37}37.6 %
{col 2}1.000               {col 37}37.6 %
{hline 80}
{txt}
{com}.         
. * Avg. HIEL X Euro Origins 
.         
. regsensitivity breakdown avg_efw hiel_share_euro share_euro efw_colonizer $w1 $model4, compare($w1) ///  Column 6
>         cbar(0.25(0.25)1)  
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=      -0.047
{txt}Treatment{col 18}{res}: hiel_share_euro{col 48}{txt}Beta(medium){col 67}{res}=       0.167
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.006
{col 48}{txt}R2(medium){col 67}{res}=       0.619
{col 48}{txt}Var(Y){col 67}{res}=       0.270
{col 48}{txt}Var(X){col 67}{res}=       0.771
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.459

{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}0.250               {col 37}37.7 %
{col 2}0.500               {col 37}37.4 %
{col 2}0.750               {col 37}37.4 %
{col 2}1.000               {col 37}37.4 %
{hline 80}
{txt}
{com}.         
.         
. * Panel C: Share Euro 2  
. 
. ** Oster (2019)
. 
. * Avg. HIEL
. regsensitivity breakdown avg_efw efw_colonizer share_euro2 $w1 $baseline, compare($w1) ///  Column 2
>         oster rlong(1.3, relative) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: Oster (2019){col 48}{txt}Number of obs{col 67}{res}=          66
{col 48}{txt}Beta(short){col 67}{res}=       0.539
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       0.443
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.109
{col 48}{txt}R2(medium){col 67}{res}=       0.307
{col 48}{txt}Var(Y){col 67}{res}=       0.617
{col 48}{txt}Var(X){col 67}{res}=       0.233
{txt}Hypothesis{col 18}{res}: Beta != 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.207
{txt}Other Params{col 18}{res}: R-squared(long) = 1
{hline 80}
{col 2}{txt}Beta(Hypothesis){col 37}Delta(Breakdown)
{hline 80}
{col 2}{res}0.000               {col 37}87.2 %
{hline 80}
{txt}
{com}.         
. regsensitivity breakdown avg_efw efw_colonizer share_euro2 $w1 $model4, compare($w1) ///  Column 3
>         oster rlong(1.3, relative) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: Oster (2019){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=       0.520
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       1.299
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.015
{col 48}{txt}R2(medium){col 67}{res}=       0.569
{col 48}{txt}Var(Y){col 67}{res}=       0.278
{col 48}{txt}Var(X){col 67}{res}=       0.016
{txt}Hypothesis{col 18}{res}: Beta != 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.010
{txt}Other Params{col 18}{res}: R-squared(long) = 1
{hline 80}
{col 2}{txt}Beta(Hypothesis){col 37}Delta(Breakdown)
{hline 80}
{col 2}{res}0.000               {col 37}287.5%
{hline 80}
{txt}
{com}.         
. regsensitivity breakdown avg_efw efw_colonizer share_euro2 hiel_share_euro2 $w1 $baseline, compare($w1) ///  Column 5
>         oster rlong(1.3, relative) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: Oster (2019){col 48}{txt}Number of obs{col 67}{res}=          66
{col 48}{txt}Beta(short){col 67}{res}=       0.531
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       0.427
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.108
{col 48}{txt}R2(medium){col 67}{res}=       0.299
{col 48}{txt}Var(Y){col 67}{res}=       0.607
{col 48}{txt}Var(X){col 67}{res}=       0.232
{txt}Hypothesis{col 18}{res}: Beta != 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.202
{txt}Other Params{col 18}{res}: R-squared(long) = 1
{hline 80}
{col 2}{txt}Beta(Hypothesis){col 37}Delta(Breakdown)
{hline 80}
{col 2}{res}0.000               {col 37}73.1 %
{hline 80}
{txt}
{com}.         
. regsensitivity breakdown avg_efw efw_colonizer share_euro2 hiel_share_euro2 $w1 $model4, compare($w1) ///  Column 6
>         oster rlong(1.3, relative) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: Oster (2019){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=       0.410
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       1.067
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.008
{col 48}{txt}R2(medium){col 67}{res}=       0.612
{col 48}{txt}Var(Y){col 67}{res}=       0.274
{col 48}{txt}Var(X){col 67}{res}=       0.014
{txt}Hypothesis{col 18}{res}: Beta != 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.009
{txt}Other Params{col 18}{res}: R-squared(long) = 1
{hline 80}
{col 2}{txt}Beta(Hypothesis){col 37}Delta(Breakdown)
{hline 80}
{col 2}{res}0.000               {col 37}307.5%
{hline 80}
{txt}
{com}.         
. * Euro Origins 
.         
. regsensitivity breakdown avg_efw share_euro2 efw_colonizer hiel_share_euro2 $w1 $model4, compare($w1) ///  Column 6
>         oster rlong(1.3, relative) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: Oster (2019){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=      -0.137
{txt}Treatment{col 18}{res}: share_euro2{col 48}{txt}Beta(medium){col 67}{res}=      -1.433
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.006
{col 48}{txt}R2(medium){col 67}{res}=       0.611
{col 48}{txt}Var(Y){col 67}{res}=       0.274
{col 48}{txt}Var(X){col 67}{res}=       0.093
{txt}Hypothesis{col 18}{res}: Beta != 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.007
{txt}Other Params{col 18}{res}: R-squared(long) = 1
{hline 80}
{col 2}{txt}Beta(Hypothesis){col 37}Delta(Breakdown)
{hline 80}
{col 2}{res}0.000               {col 37}361.6%
{hline 80}
{txt}
{com}.         
. * Avg. HIEL X Euro Origins 
.         
. regsensitivity breakdown avg_efw hiel_share_euro2 share_euro2 efw_colonizer $w1 $model4, compare($w1) ///  Column 6
>         oster rlong(1.3, relative) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: Oster (2019){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=       0.016
{txt}Treatment{col 18}{res}: hiel_share_euro2{col 48}{txt}Beta(medium){col 67}{res}=       0.178
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.005
{col 48}{txt}R2(medium){col 67}{res}=       0.611
{col 48}{txt}Var(Y){col 67}{res}=       0.273
{col 48}{txt}Var(X){col 67}{res}=       5.921
{txt}Hypothesis{col 18}{res}: Beta != 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.413
{txt}Other Params{col 18}{res}: R-squared(long) = 1
{hline 80}
{col 2}{txt}Beta(Hypothesis){col 37}Delta(Breakdown)
{hline 80}
{col 2}{res}0.000               {col 37}507.1%
{hline 80}
{txt}
{com}.         
.         
. *-- DMP (2022)
. * 1) Rybar = + inf, c=(0.25, 0.5, 0.75, 1)
. 
. * Avg. HIEL
. regsensitivity breakdown avg_efw efw_colonizer share_euro2 $w1 $baseline, compare($w1) ///  Column 2
>          cbar(0.25(0.25)1) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          66
{col 48}{txt}Beta(short){col 67}{res}=       0.539
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       0.443
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.109
{col 48}{txt}R2(medium){col 67}{res}=       0.307
{col 48}{txt}Var(Y){col 67}{res}=       0.617
{col 48}{txt}Var(X){col 67}{res}=       0.233
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.207

{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}0.250               {col 37}71.5 %
{col 2}0.500               {col 37}65.5 %
{col 2}0.750               {col 37}64.5 %
{col 2}1.000               {col 37}64.5 %
{hline 80}
{txt}
{com}.         
. regsensitivity breakdown avg_efw efw_colonizer share_euro2 $w1 $model4, compare($w1) ///  Column 3
>          cbar(0.25(0.25)1) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=       0.520
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       1.299
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.015
{col 48}{txt}R2(medium){col 67}{res}=       0.569
{col 48}{txt}Var(Y){col 67}{res}=       0.278
{col 48}{txt}Var(X){col 67}{res}=       0.016
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.010

{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}0.250               {col 37}41.8 %
{col 2}0.500               {col 37}41.2 %
{col 2}0.750               {col 37}41.2 %
{col 2}1.000               {col 37}41.2 %
{hline 80}
{txt}
{com}.          
. regsensitivity breakdown avg_efw efw_colonizer share_euro2 hiel_share_euro2 $w1 $baseline, compare($w1) ///  Column 5
>         cbar(0.25(0.25)1) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          66
{col 48}{txt}Beta(short){col 67}{res}=       0.531
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       0.427
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.108
{col 48}{txt}R2(medium){col 67}{res}=       0.299
{col 48}{txt}Var(Y){col 67}{res}=       0.607
{col 48}{txt}Var(X){col 67}{res}=       0.232
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.202

{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}0.250               {col 37}63.5 %
{col 2}0.500               {col 37}59.3 %
{col 2}0.750               {col 37}59.0 %
{col 2}1.000               {col 37}59.0 %
{hline 80}
{txt}
{com}.         
. regsensitivity breakdown avg_efw efw_colonizer share_euro2 hiel_share_euro2 $w1 $model4, compare($w1) ///  Column 6
>         cbar(0.25(0.25)1) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=       0.410
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       1.067
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.008
{col 48}{txt}R2(medium){col 67}{res}=       0.612
{col 48}{txt}Var(Y){col 67}{res}=       0.274
{col 48}{txt}Var(X){col 67}{res}=       0.014
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.009

{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}0.250               {col 37}41.0 %
{col 2}0.500               {col 37}40.5 %
{col 2}0.750               {col 37}40.5 %
{col 2}1.000               {col 37}40.5 %
{hline 80}
{txt}
{com}.         
. * Euro Origins 
.         
. regsensitivity breakdown avg_efw share_euro2 efw_colonizer hiel_share_euro2 $w1 $model4, compare($w1) ///  Column 6
>         cbar(0.25(0.25)1) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=      -0.137
{txt}Treatment{col 18}{res}: share_euro2{col 48}{txt}Beta(medium){col 67}{res}=      -1.433
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.006
{col 48}{txt}R2(medium){col 67}{res}=       0.611
{col 48}{txt}Var(Y){col 67}{res}=       0.274
{col 48}{txt}Var(X){col 67}{res}=       0.093
{txt}Hypothesis{col 18}{res}: Beta < 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.007

{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}0.250               {col 37}9.2  %
{col 2}0.500               {col 37}9.2  %
{col 2}0.750               {col 37}9.2  %
{col 2}1.000               {col 37}9.2  %
{hline 80}
{txt}
{com}.         
. * Avg. HIEL X Euro Origins 
.         
. regsensitivity breakdown avg_efw hiel_share_euro2 share_euro2 efw_colonizer $w1 $model4, compare($w1) ///  Column 6
>         cbar(0.25(0.25)1) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=       0.016
{txt}Treatment{col 18}{res}: hiel_share_euro2{col 48}{txt}Beta(medium){col 67}{res}=       0.178
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.005
{col 48}{txt}R2(medium){col 67}{res}=       0.611
{col 48}{txt}Var(Y){col 67}{res}=       0.273
{col 48}{txt}Var(X){col 67}{res}=       5.921
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.413

{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}0.250               {col 37}9.1  %
{col 2}0.500               {col 37}9.1  %
{col 2}0.750               {col 37}9.1  %
{col 2}1.000               {col 37}9.1  %
{hline 80}
{txt}
{com}.         
. 
. *** Table 6:
. 
. cd "/Users/jpmvbastos/Documents/GitHub/ColonialLegacy/"
{res}/Users/jpmvbastos/Documents/GitHub/ColonialLegacy
{txt}
{com}. use  "Data/ColonialEFW_Panel.dta", clear
{txt}
{com}. 
. global full_indep "year america africa asia lat_abst landlock island humid* temp* steplow  deslow stepmid desmid  drystep hiland drywint goldm iron silv zinc ruggedness logem4 lpd1500s legor_uk legor_fr i.year i.colonizer_indep"
{txt}
{com}. 
. global full_avg "year america africa asia lat_abst landlock island humid* temp* steplow  deslow stepmid desmid  drystep hiland drywint goldm iron silv zinc ruggedness logem4 lpd1500s legor_uk legor_fr i.year i.colonizer"
{txt}
{com}. 
. global baseline_panel "year ruggedness logem4 lpd1500s i.year"
{txt}
{com}. 
. gen indep_time = hiel_indep * time
{txt}(2,332 missing values generated)

{com}. gen avg_time = efw_colonizer * time
{txt}(2,332 missing values generated)

{com}. 
. ** Oster (2019)
. 
. * Column 3
. 
. * HIEL Indep
. regsensitivity breakdown efw hiel_indep indep_time time $full_indep ///
>         if year >= year_independence, compare($w1) ///
>         oster rlong(1.3, relative) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: Oster (2019){col 48}{txt}Number of obs{col 67}{res}=       1,361
{col 48}{txt}Beta(short){col 67}{res}=       0.084
{txt}Treatment{col 18}{res}: hiel_indep{col 48}{txt}Beta(medium){col 67}{res}=       1.245
{txt}Outcome{col 18}{res}: efw{col 48}{txt}R2(short){col 67}{res}=       0.000
{col 48}{txt}R2(medium){col 67}{res}=       0.281
{col 48}{txt}Var(Y){col 67}{res}=       0.414
{col 48}{txt}Var(X){col 67}{res}=       0.013
{txt}Hypothesis{col 18}{res}: Beta != 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.010
{txt}Other Params{col 18}{res}: R-squared(long) = 1
{hline 80}
{col 2}{txt}Beta(Hypothesis){col 37}Delta(Breakdown)
{hline 80}
{col 2}{res}0.000               {col 37}35.4 %
{hline 80}
{txt}
{com}. 
. * HIEL Indep X Years since Indep  
. regsensitivity breakdown efw indep_time hiel_indep time $full_indep ///
>         if year>=year_indep, compare($w1) ///
>         oster rlong(1.3, relative) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: Oster (2019){col 48}{txt}Number of obs{col 67}{res}=       1,361
{col 48}{txt}Beta(short){col 67}{res}=       0.002
{txt}Treatment{col 18}{res}: indep_time{col 48}{txt}Beta(medium){col 67}{res}=       0.003
{txt}Outcome{col 18}{res}: efw{col 48}{txt}R2(short){col 67}{res}=       0.001
{col 48}{txt}R2(medium){col 67}{res}=       0.281
{col 48}{txt}Var(Y){col 67}{res}=       0.414
{col 48}{txt}Var(X){col 67}{res}=      81.374
{txt}Hypothesis{col 18}{res}: Beta != 0         {col 48}{txt}Var(X_Residual){col 67}{res}=      80.190
{txt}Other Params{col 18}{res}: R-squared(long) = 1
{hline 80}
{col 2}{txt}Beta(Hypothesis){col 37}Delta(Breakdown)
{hline 80}
{col 2}{res}0.000               {col 37}104.5%
{hline 80}
{txt}
{com}.         
. * Column 5
. 
. * HIEL Indep
. regsensitivity breakdown efw efw_colonizer avg_time time $baseline_panel $w1 ///
>         if year >= year_independence, ///
>         compare($w1) ///
>         oster rlong(1.3, relative)
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: Oster (2019){col 48}{txt}Number of obs{col 67}{res}=       1,361
{col 48}{txt}Beta(short){col 67}{res}=       0.693
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       0.691
{txt}Outcome{col 18}{res}: efw{col 48}{txt}R2(short){col 67}{res}=       0.029
{col 48}{txt}R2(medium){col 67}{res}=       0.178
{col 48}{txt}Var(Y){col 67}{res}=       0.571
{col 48}{txt}Var(X){col 67}{res}=       0.034
{txt}Hypothesis{col 18}{res}: Beta != 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.026
{txt}Other Params{col 18}{res}: R-squared(long) = 1
{hline 80}
{col 2}{txt}Beta(Hypothesis){col 37}Delta(Breakdown)
{hline 80}
{col 2}{res}0.000               {col 37}63.3 %
{hline 80}
{txt}
{com}. 
.         
. * HIEL Indep X Years since Indep  
. regsensitivity breakdown efw avg_time efw_colonizer time $baseline_panel $w1 ///
>         if year >= year_independence, ///
>         compare($w1) ///
>         oster rlong(1.3, relative)
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: Oster (2019){col 48}{txt}Number of obs{col 67}{res}=       1,361
{col 48}{txt}Beta(short){col 67}{res}=       0.004
{txt}Treatment{col 18}{res}: avg_time{col 48}{txt}Beta(medium){col 67}{res}=       0.005
{txt}Outcome{col 18}{res}: efw{col 48}{txt}R2(short){col 67}{res}=       0.002
{col 48}{txt}R2(medium){col 67}{res}=       0.156
{col 48}{txt}Var(Y){col 67}{res}=       0.555
{col 48}{txt}Var(X){col 67}{res}=      71.540
{txt}Hypothesis{col 18}{res}: Beta != 0         {col 48}{txt}Var(X_Residual){col 67}{res}=      67.437
{txt}Other Params{col 18}{res}: R-squared(long) = 1
{hline 80}
{col 2}{txt}Beta(Hypothesis){col 37}Delta(Breakdown)
{hline 80}
{col 2}{res}0.000               {col 37}100.2%
{hline 80}
{txt}
{com}. 
.         
. * Column 6 
.         
. * Avg. HIEL
. regsensitivity breakdown efw efw_colonizer avg_time time $full_avg ///
>         if year >= year_independence, compare($w1) ///
>         oster rlong(1.3, relative) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: Oster (2019){col 48}{txt}Number of obs{col 67}{res}=       1,361
{col 48}{txt}Beta(short){col 67}{res}=       0.460
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       1.827
{txt}Outcome{col 18}{res}: efw{col 48}{txt}R2(short){col 67}{res}=       0.004
{col 48}{txt}R2(medium){col 67}{res}=       0.255
{col 48}{txt}Var(Y){col 67}{res}=       0.422
{col 48}{txt}Var(X){col 67}{res}=       0.008
{txt}Hypothesis{col 18}{res}: Beta != 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.006
{txt}Other Params{col 18}{res}: R-squared(long) = 1
{hline 80}
{col 2}{txt}Beta(Hypothesis){col 37}Delta(Breakdown)
{hline 80}
{col 2}{res}0.000               {col 37}39.8 %
{hline 80}
{txt}
{com}.         
. 
. * Avg. HIEL X Years since Indep  
. regsensitivity breakdown efw avg_time efw_colonizer time $full_avg ///
>         if year>=year_indep, compare($w1) ///
>         oster rlong(1.3, relative) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: Oster (2019){col 48}{txt}Number of obs{col 67}{res}=       1,361
{col 48}{txt}Beta(short){col 67}{res}=      -0.002
{txt}Treatment{col 18}{res}: avg_time{col 48}{txt}Beta(medium){col 67}{res}=       0.009
{txt}Outcome{col 18}{res}: efw{col 48}{txt}R2(short){col 67}{res}=       0.000
{col 48}{txt}R2(medium){col 67}{res}=       0.253
{col 48}{txt}Var(Y){col 67}{res}=       0.420
{col 48}{txt}Var(X){col 67}{res}=      55.756
{txt}Hypothesis{col 18}{res}: Beta != 0         {col 48}{txt}Var(X_Residual){col 67}{res}=      51.242
{txt}Other Params{col 18}{res}: R-squared(long) = 1
{hline 80}
{col 2}{txt}Beta(Hypothesis){col 37}Delta(Breakdown)
{hline 80}
{col 2}{res}0.000               {col 37}27.1 %
{hline 80}
{txt}
{com}.         
. *-- DMP (2022)
. * 1) Rybar = + inf, c=(0.25, 0.5, 0.75, 1)
. 
. * Column 3
. 
. * HIEL Indep
. regsensitivity breakdown efw hiel_indep indep_time time $full_indep ///
>         if year >= year_independence, compare($w1) ///
>         cbar(0.25(0.25)1)
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=       1,361
{col 48}{txt}Beta(short){col 67}{res}=       0.084
{txt}Treatment{col 18}{res}: hiel_indep{col 48}{txt}Beta(medium){col 67}{res}=       1.245
{txt}Outcome{col 18}{res}: efw{col 48}{txt}R2(short){col 67}{res}=       0.000
{col 48}{txt}R2(medium){col 67}{res}=       0.281
{col 48}{txt}Var(Y){col 67}{res}=       0.414
{col 48}{txt}Var(X){col 67}{res}=       0.013
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.010

{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}0.250               {col 37}36.0 %
{col 2}0.500               {col 37}35.8 %
{col 2}0.750               {col 37}35.8 %
{col 2}1.000               {col 37}35.8 %
{hline 80}
{txt}
{com}. 
. * HIEL Indep X Years since Indep  
. regsensitivity breakdown efw indep_time hiel_indep time $full_indep ///
>         if year>=year_indep, compare($w1) ///
>         cbar(0.25(0.25)1)
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=       1,361
{col 48}{txt}Beta(short){col 67}{res}=       0.002
{txt}Treatment{col 18}{res}: indep_time{col 48}{txt}Beta(medium){col 67}{res}=       0.003
{txt}Outcome{col 18}{res}: efw{col 48}{txt}R2(short){col 67}{res}=       0.001
{col 48}{txt}R2(medium){col 67}{res}=       0.281
{col 48}{txt}Var(Y){col 67}{res}=       0.414
{col 48}{txt}Var(X){col 67}{res}=      81.374
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=      80.190

{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}0.250               {col 37}42.0 %
{col 2}0.500               {col 37}41.4 %
{col 2}0.750               {col 37}41.4 %
{col 2}1.000               {col 37}41.4 %
{hline 80}
{txt}
{com}.         
. * Column 5
. 
. * HIEL Indep
. regsensitivity breakdown efw efw_colonizer avg_time time $baseline_panel $w1 ///
>         if year >= year_independence, ///
>         compare($w1) ///
>         cbar(0.25(0.25)1)
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=       1,361
{col 48}{txt}Beta(short){col 67}{res}=       0.693
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       0.691
{txt}Outcome{col 18}{res}: efw{col 48}{txt}R2(short){col 67}{res}=       0.029
{col 48}{txt}R2(medium){col 67}{res}=       0.178
{col 48}{txt}Var(Y){col 67}{res}=       0.571
{col 48}{txt}Var(X){col 67}{res}=       0.034
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.026

{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}0.250               {col 37}28.9 %
{col 2}0.500               {col 37}28.9 %
{col 2}0.750               {col 37}28.9 %
{col 2}1.000               {col 37}28.9 %
{hline 80}
{txt}
{com}. 
.         
. * HIEL Indep X Years since Indep  
. regsensitivity breakdown efw avg_time efw_colonizer time $baseline_panel $w1 ///
>         if year >= year_independence, ///
>         compare($w1) ///
>         cbar(0.25(0.25)1)
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=       1,361
{col 48}{txt}Beta(short){col 67}{res}=       0.004
{txt}Treatment{col 18}{res}: avg_time{col 48}{txt}Beta(medium){col 67}{res}=       0.005
{txt}Outcome{col 18}{res}: efw{col 48}{txt}R2(short){col 67}{res}=       0.002
{col 48}{txt}R2(medium){col 67}{res}=       0.156
{col 48}{txt}Var(Y){col 67}{res}=       0.555
{col 48}{txt}Var(X){col 67}{res}=      71.540
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=      67.437

{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}0.250               {col 37}21.5 %
{col 2}0.500               {col 37}21.5 %
{col 2}0.750               {col 37}21.5 %
{col 2}1.000               {col 37}21.5 %
{hline 80}
{txt}
{com}. 
.         
. * Column 6 
.         
. * Avg. HIEL
. regsensitivity breakdown efw efw_colonizer avg_time time $full_avg ///
>         if year >= year_independence, compare($w1) ///
>         cbar(0.25(0.25)1)
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=       1,361
{col 48}{txt}Beta(short){col 67}{res}=       0.460
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       1.827
{txt}Outcome{col 18}{res}: efw{col 48}{txt}R2(short){col 67}{res}=       0.004
{col 48}{txt}R2(medium){col 67}{res}=       0.255
{col 48}{txt}Var(Y){col 67}{res}=       0.422
{col 48}{txt}Var(X){col 67}{res}=       0.008
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.006

{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}0.250               {col 37}38.8 %
{col 2}0.500               {col 37}38.4 %
{col 2}0.750               {col 37}38.4 %
{col 2}1.000               {col 37}38.4 %
{hline 80}
{txt}
{com}.         
. 
. * Avg. HIEL X Years since Indep  
. regsensitivity breakdown efw avg_time efw_colonizer time $full_avg ///
>         if year>=year_indep, compare($w1) ///
>         cbar(0.25(0.25)1)
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=       1,361
{col 48}{txt}Beta(short){col 67}{res}=      -0.002
{txt}Treatment{col 18}{res}: avg_time{col 48}{txt}Beta(medium){col 67}{res}=       0.009
{txt}Outcome{col 18}{res}: efw{col 48}{txt}R2(short){col 67}{res}=       0.000
{col 48}{txt}R2(medium){col 67}{res}=       0.253
{col 48}{txt}Var(Y){col 67}{res}=       0.420
{col 48}{txt}Var(X){col 67}{res}=      55.756
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=      51.242

{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}0.250               {col 37}37.3 %
{col 2}0.500               {col 37}37.0 %
{col 2}0.750               {col 37}37.0 %
{col 2}1.000               {col 37}37.0 %
{hline 80}
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/xd/gksdz50d7r3765bw8t_98y880000gn/T//SD40738.000000"
{txt}
{com}. **** TABLE 3
. 
. global w1 "america africa asia lat_abst landlock island"
{txt}
{com}. 
. global model3 "ruggedness logem4 lpd1500s humid* temp* steplow  deslow stepmid desmid drystep hiland drywint goldm iron silv zinc oilres i.colonizer"
{txt}
{com}. 
. global model4 "ruggedness logem4 lpd1500s humid* temp* steplow  deslow stepmid desmid  drystep hiland drywint goldm iron silv zinc oilres legor_fr legor_uk i.colonizer"
{txt}
{com}. 
. 
. * Rybar = Rxbar, c=1
. regsensitivity breakdown avg_efw efw_colonizer $w1 $model3, rybar(=rxbar) ///
>         compare($w1) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=       1,612
{col 48}{txt}Beta(short){col 67}{res}=       0.036
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       1.198
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.000
{col 48}{txt}R2(medium){col 67}{res}=       0.437
{col 48}{txt}Var(Y){col 67}{res}=       0.350
{col 48}{txt}Var(X){col 67}{res}=       0.016
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.011
{txt}Other Params{col 18}{res}: rybar = rxbar
{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}1.000               {col 37}61.7 %
{hline 80}
{txt}
{com}.         
. regsensitivity breakdown avg_efw efw_colonizer $w1 $model4, rybar(=rxbar) ///
>         compare($w1) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=       1,612
{col 48}{txt}Beta(short){col 67}{res}=       0.407
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       1.639
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.009
{col 48}{txt}R2(medium){col 67}{res}=       0.483
{col 48}{txt}Var(Y){col 67}{res}=       0.299
{col 48}{txt}Var(X){col 67}{res}=       0.016
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.010
{txt}Other Params{col 18}{res}: rybar = rxbar
{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}1.000               {col 37}70.5 %
{hline 80}
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/xd/gksdz50d7r3765bw8t_98y880000gn/T//SD40738.000000"
{txt}
{com}. **** TABLE 4 - Timing and Alternative Measures
. 
. global baseline "ruggedness lpd1500s"
{txt}
{com}. 
. gen postwar_int = postwar*hiel_indep
{txt}(2,332 missing values generated)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/xd/gksdz50d7r3765bw8t_98y880000gn/T//SD40738.000000"
{txt}
{com}. **** TABLE 5 - Euro Settlers / Origins
. 
. global baseline "ruggedness lpd1500s"
{txt}
{com}. 
. gen share_euro2 = share_euro
{err}share_euro not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/jpmvbastos/Documents/GitHub/ColonialLegacy/Results/Review/sensitivity.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}30 Jan 2025, 17:11:37
{txt}{.-}
{smcl}
{txt}{sf}{ul off}{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/jpmvbastos/Documents/GitHub/ColonialLegacy/Results/Review/sensitivity.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}30 Jan 2025, 17:12:52

{com}. do "/var/folders/xd/gksdz50d7r3765bw8t_98y880000gn/T//SD40738.000000"
{txt}
{com}. **** TABLE 3
. 
. global w1 "america africa asia lat_abst landlock island"
{txt}
{com}. 
. global model3 "ruggedness logem4 lpd1500s humid* temp* steplow  deslow stepmid desmid drystep hiland drywint goldm iron silv zinc oilres i.colonizer"
{txt}
{com}. 
. global model4 "ruggedness logem4 lpd1500s humid* temp* steplow  deslow stepmid desmid  drystep hiland drywint goldm iron silv zinc oilres legor_fr legor_uk i.colonizer"
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/xd/gksdz50d7r3765bw8t_98y880000gn/T//SD40738.000000"
{txt}
{com}. **** TABLE 5 - Euro Settlers / Origins
. 
. global baseline "ruggedness lpd1500s"
{txt}
{com}. 
. gen share_euro2 = share_euro
{txt}(1 missing value generated)

{com}. replace share_euro2 = .2743236 if country=="Barbados" | country=="Bahamas"
{txt}(2 real changes made)

{com}. replace share_euro2 = .9736003 if country=="New Zealand"
{txt}(1 real change made)

{com}. 
. foreach v in euro_share share_euro share_euro2 {c -(}
{txt}  2{com}.         replace `v' = `v' * 100
{txt}  3{com}. {c )-}
{txt}(58 real changes made)
(42 real changes made)
(45 real changes made)

{com}. 
. gen hiel_euro_share = efw_colonizer * euro_share
{txt}(67 missing values generated)

{com}. gen hiel_share_euro = efw_colonizer * share_euro
{txt}(21 missing values generated)

{com}. gen hiel_share_euro2 = efw_colonizer * share_euro2
{txt}(21 missing values generated)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/xd/gksdz50d7r3765bw8t_98y880000gn/T//SD40738.000000"
{txt}
{com}. *** Panel A:
. 
. ** Rybar = Rxbar, c=1
. 
. * Avg. HIEL
. regsensitivity breakdown avg_efw efw_colonizer euro_share $w1 $baseline, compare($w1) ///  Column 2
>         rybar(=rxbar) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          37
{col 48}{txt}Beta(short){col 67}{res}=       0.371
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       0.337
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.087
{col 48}{txt}R2(medium){col 67}{res}=       0.406
{col 48}{txt}Var(Y){col 67}{res}=       0.434
{col 48}{txt}Var(X){col 67}{res}=       0.274
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.190
{txt}Other Params{col 18}{res}: rybar = rxbar
{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}1.000               {col 37}62.6 %
{hline 80}
{txt}
{com}.         
. * Euro Share
. regsensitivity breakdown avg_efw euro_share efw_colonizer $w1 $baseline, compare($w1) ///  Column 2
>         rybar(=rxbar) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          37
{col 48}{txt}Beta(short){col 67}{res}=       0.019
{txt}Treatment{col 18}{res}: euro_share{col 48}{txt}Beta(medium){col 67}{res}=       0.011
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.222
{col 48}{txt}R2(medium){col 67}{res}=       0.494
{col 48}{txt}Var(Y){col 67}{res}=       0.510
{col 48}{txt}Var(X){col 67}{res}=     317.683
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=     104.972
{txt}Other Params{col 18}{res}: rybar = rxbar
{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}1.000               {col 37}37.5 %
{hline 80}
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/xd/gksdz50d7r3765bw8t_98y880000gn/T//SD40738.000000"
{txt}
{com}. * Panel B: Share Euro
. 
. ** Rybar = Rxbar, c=1
. 
. * Avg. HIEL
. regsensitivity breakdown avg_efw efw_colonizer share_euro $w1 $baseline, compare($w1) ///  Column 2
>         rybar(=rxbar) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          66
{col 48}{txt}Beta(short){col 67}{res}=       0.614
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       0.446
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.141
{col 48}{txt}R2(medium){col 67}{res}=       0.350
{col 48}{txt}Var(Y){col 67}{res}=       0.657
{col 48}{txt}Var(X){col 67}{res}=       0.246
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.210
{txt}Other Params{col 18}{res}: rybar = rxbar
{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}1.000               {col 37}74.5 %
{hline 80}
{txt}
{com}.         
. regsensitivity breakdown avg_efw efw_colonizer share_euro $w1 $model4, compare($w1) ///  Column 3
>         rybar(=rxbar) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=       0.318
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       1.442
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.006
{col 48}{txt}R2(medium){col 67}{res}=       0.574
{col 48}{txt}Var(Y){col 67}{res}=       0.272
{col 48}{txt}Var(X){col 67}{res}=       0.016
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.010
{txt}Other Params{col 18}{res}: rybar = rxbar
{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}1.000               {col 37}64.8 %
{hline 80}
{txt}
{com}.         
. regsensitivity breakdown avg_efw efw_colonizer share_euro hiel_share_euro $w1 $baseline, compare($w1) ///  Column 5
>         rybar(=rxbar) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          66
{col 48}{txt}Beta(short){col 67}{res}=       0.613
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       0.448
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.140
{col 48}{txt}R2(medium){col 67}{res}=       0.350
{col 48}{txt}Var(Y){col 67}{res}=       0.656
{col 48}{txt}Var(X){col 67}{res}=       0.245
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.210
{txt}Other Params{col 18}{res}: rybar = rxbar
{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}1.000               {col 37}74.7 %
{hline 80}
{txt}
{com}.         
. regsensitivity breakdown avg_efw efw_colonizer share_euro hiel_share_euro $w1 $model4, compare($w1) ///  Column 6
>         rybar(=rxbar) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=       0.305
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       1.344
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.005
{col 48}{txt}R2(medium){col 67}{res}=       0.618
{col 48}{txt}Var(Y){col 67}{res}=       0.270
{col 48}{txt}Var(X){col 67}{res}=       0.016
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.010
{txt}Other Params{col 18}{res}: rybar = rxbar
{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}1.000               {col 37}61.3 %
{hline 80}
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/xd/gksdz50d7r3765bw8t_98y880000gn/T//SD40738.000000"
{txt}
{com}. * Avg. HIEL X Euro Origins 
.         
. regsensitivity breakdown avg_efw hiel_share_euro share_euro efw_colonizer $w1 $model4, compare($w1) ///  Column 6
>         rybar(=rxbar) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=      -0.047
{txt}Treatment{col 18}{res}: hiel_share_euro{col 48}{txt}Beta(medium){col 67}{res}=       0.167
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.006
{col 48}{txt}R2(medium){col 67}{res}=       0.619
{col 48}{txt}Var(Y){col 67}{res}=       0.270
{col 48}{txt}Var(X){col 67}{res}=       0.771
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.459
{txt}Other Params{col 18}{res}: rybar = rxbar
{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}1.000               {col 37}56.1 %
{hline 80}
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/xd/gksdz50d7r3765bw8t_98y880000gn/T//SD40738.000000"
{txt}
{com}. * Panel C: Share Euro 2  
. 
. ** Rybar = Rxbar, c=1
. 
. * Avg. HIEL
. regsensitivity breakdown avg_efw efw_colonizer share_euro2 $w1 $baseline, compare($w1) ///  Column 2
>         rybar(=rxbar) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          66
{col 48}{txt}Beta(short){col 67}{res}=       0.539
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       0.443
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.109
{col 48}{txt}R2(medium){col 67}{res}=       0.307
{col 48}{txt}Var(Y){col 67}{res}=       0.617
{col 48}{txt}Var(X){col 67}{res}=       0.233
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.207
{txt}Other Params{col 18}{res}: rybar = rxbar
{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}1.000               {col 37}79.8 %
{hline 80}
{txt}
{com}.         
. regsensitivity breakdown avg_efw efw_colonizer share_euro2 $w1 $model4, compare($w1) ///  Column 3
>         rybar(=rxbar) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=       0.520
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       1.299
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.015
{col 48}{txt}R2(medium){col 67}{res}=       0.569
{col 48}{txt}Var(Y){col 67}{res}=       0.278
{col 48}{txt}Var(X){col 67}{res}=       0.016
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.010
{txt}Other Params{col 18}{res}: rybar = rxbar
{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}1.000               {col 37}59.9 %
{hline 80}
{txt}
{com}.         
. regsensitivity breakdown avg_efw efw_colonizer share_euro2 hiel_share_euro2 $w1 $baseline, compare($w1) ///  Column 5
>         rybar(=rxbar) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          66
{col 48}{txt}Beta(short){col 67}{res}=       0.531
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       0.427
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.108
{col 48}{txt}R2(medium){col 67}{res}=       0.299
{col 48}{txt}Var(Y){col 67}{res}=       0.607
{col 48}{txt}Var(X){col 67}{res}=       0.232
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.202
{txt}Other Params{col 18}{res}: rybar = rxbar
{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}1.000               {col 37}77.5 %
{hline 80}
{txt}
{com}.         
. regsensitivity breakdown avg_efw efw_colonizer share_euro2 hiel_share_euro2 $w1 $model4, compare($w1) ///  Column 6
>         rybar(=rxbar) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=       0.410
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       1.067
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.008
{col 48}{txt}R2(medium){col 67}{res}=       0.612
{col 48}{txt}Var(Y){col 67}{res}=       0.274
{col 48}{txt}Var(X){col 67}{res}=       0.014
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.009
{txt}Other Params{col 18}{res}: rybar = rxbar
{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}1.000               {col 37}56.5 %
{hline 80}
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/xd/gksdz50d7r3765bw8t_98y880000gn/T//SD40738.000000"
{txt}
{com}. * Avg. HIEL X Euro Origins 
.         
. regsensitivity breakdown avg_efw hiel_share_euro2 share_euro2 efw_colonizer $w1 $model4, compare($w1) ///  Column 6
>         rybar(=rxbar) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=          53
{col 48}{txt}Beta(short){col 67}{res}=       0.016
{txt}Treatment{col 18}{res}: hiel_share_euro2{col 48}{txt}Beta(medium){col 67}{res}=       0.178
{txt}Outcome{col 18}{res}: avg_efw{col 48}{txt}R2(short){col 67}{res}=       0.005
{col 48}{txt}R2(medium){col 67}{res}=       0.611
{col 48}{txt}Var(Y){col 67}{res}=       0.273
{col 48}{txt}Var(X){col 67}{res}=       5.921
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.413
{txt}Other Params{col 18}{res}: rybar = rxbar
{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}1.000               {col 37}26.4 %
{hline 80}
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/xd/gksdz50d7r3765bw8t_98y880000gn/T//SD40738.000000"
{txt}
{com}. use  "Data/ColonialEFW_Panel.dta", clear
{txt}
{com}. 
. global full_indep "year america africa asia lat_abst landlock island humid* temp* steplow  deslow stepmid desmid  drystep hiland drywint goldm iron silv zinc ruggedness logem4 lpd1500s legor_uk legor_fr i.year i.colonizer_indep"
{txt}
{com}. 
. global full_avg "year america africa asia lat_abst landlock island humid* temp* steplow  deslow stepmid desmid  drystep hiland drywint goldm iron silv zinc ruggedness logem4 lpd1500s legor_uk legor_fr i.year i.colonizer"
{txt}
{com}. 
. global baseline_panel "year ruggedness logem4 lpd1500s i.year"
{txt}
{com}. 
. gen indep_time = hiel_indep * time
{txt}(2,332 missing values generated)

{com}. gen avg_time = efw_colonizer* time
{txt}(2,332 missing values generated)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/xd/gksdz50d7r3765bw8t_98y880000gn/T//SD40738.000000"
{txt}
{com}. * HIEL Indep
. regsensitivity breakdown efw hiel_indep indep_time time $full_indep ///
>         if year >= year_independence, compare($w1) ///
>         rybar(=rxbar) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=       1,361
{col 48}{txt}Beta(short){col 67}{res}=       0.084
{txt}Treatment{col 18}{res}: hiel_indep{col 48}{txt}Beta(medium){col 67}{res}=       1.245
{txt}Outcome{col 18}{res}: efw{col 48}{txt}R2(short){col 67}{res}=       0.000
{col 48}{txt}R2(medium){col 67}{res}=       0.281
{col 48}{txt}Var(Y){col 67}{res}=       0.414
{col 48}{txt}Var(X){col 67}{res}=       0.013
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.010
{txt}Other Params{col 18}{res}: rybar = rxbar
{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}1.000               {col 37}74.0 %
{hline 80}
{txt}
{com}. 
. * HIEL Indep X Years since Indep  
. regsensitivity breakdown efw indep_time hiel_indep time $full_indep ///
>         if year>=year_indep, compare($w1) ///
>         rybar(=rxbar) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=       1,361
{col 48}{txt}Beta(short){col 67}{res}=       0.002
{txt}Treatment{col 18}{res}: indep_time{col 48}{txt}Beta(medium){col 67}{res}=       0.003
{txt}Outcome{col 18}{res}: efw{col 48}{txt}R2(short){col 67}{res}=       0.001
{col 48}{txt}R2(medium){col 67}{res}=       0.281
{col 48}{txt}Var(Y){col 67}{res}=       0.414
{col 48}{txt}Var(X){col 67}{res}=      81.374
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=      80.190
{txt}Other Params{col 18}{res}: rybar = rxbar
{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}1.000               {col 37}72.9 %
{hline 80}
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/xd/gksdz50d7r3765bw8t_98y880000gn/T//SD40738.000000"
{txt}
{com}. * Column 5
. 
. * HIEL Indep
. regsensitivity breakdown efw efw_colonizer avg_time time $baseline_panel $w1 ///
>         if year >= year_independence, ///
>         compare($w1) ///
>         rybar(=rxbar) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=       1,361
{col 48}{txt}Beta(short){col 67}{res}=       0.693
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       0.691
{txt}Outcome{col 18}{res}: efw{col 48}{txt}R2(short){col 67}{res}=       0.029
{col 48}{txt}R2(medium){col 67}{res}=       0.178
{col 48}{txt}Var(Y){col 67}{res}=       0.571
{col 48}{txt}Var(X){col 67}{res}=       0.034
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.026
{txt}Other Params{col 18}{res}: rybar = rxbar
{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}1.000               {col 37}67.9 %
{hline 80}
{txt}
{com}.         
. * HIEL Indep X Years since Indep  
. regsensitivity breakdown efw avg_time efw_colonizer time $baseline_panel $w1 ///
>         if year >= year_independence, ///
>         compare($w1) ///
>         rybar(=rxbar) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=       1,361
{col 48}{txt}Beta(short){col 67}{res}=       0.004
{txt}Treatment{col 18}{res}: avg_time{col 48}{txt}Beta(medium){col 67}{res}=       0.005
{txt}Outcome{col 18}{res}: efw{col 48}{txt}R2(short){col 67}{res}=       0.002
{col 48}{txt}R2(medium){col 67}{res}=       0.156
{col 48}{txt}Var(Y){col 67}{res}=       0.555
{col 48}{txt}Var(X){col 67}{res}=      71.540
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=      67.437
{txt}Other Params{col 18}{res}: rybar = rxbar
{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}1.000               {col 37}63.0 %
{hline 80}
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/xd/gksdz50d7r3765bw8t_98y880000gn/T//SD40738.000000"
{txt}
{com}. * Column 6 
.         
. * Avg. HIEL
. regsensitivity breakdown efw efw_colonizer avg_time time $full_avg ///
>         if year >= year_independence, compare($w1) ///
>         rybar(=rxbar) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=       1,361
{col 48}{txt}Beta(short){col 67}{res}=       0.460
{txt}Treatment{col 18}{res}: efw_colonizer{col 48}{txt}Beta(medium){col 67}{res}=       1.827
{txt}Outcome{col 18}{res}: efw{col 48}{txt}R2(short){col 67}{res}=       0.004
{col 48}{txt}R2(medium){col 67}{res}=       0.255
{col 48}{txt}Var(Y){col 67}{res}=       0.422
{col 48}{txt}Var(X){col 67}{res}=       0.008
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=       0.006
{txt}Other Params{col 18}{res}: rybar = rxbar
{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}1.000               {col 37}77.5 %
{hline 80}
{txt}
{com}.         
.         
. 
. * Avg. HIEL X Years since Indep  
. regsensitivity breakdown efw avg_time efw_colonizer time $full_avg ///
>         if year>=year_indep, compare($w1) ///
>         rybar(=rxbar) 
{res}
{txt}{ul:Regression Sensitivity Analysis, Breakdown Frontier}

Analysis{col 18}{res}: DMP (2022){col 48}{txt}Number of obs{col 67}{res}=       1,361
{col 48}{txt}Beta(short){col 67}{res}=      -0.002
{txt}Treatment{col 18}{res}: avg_time{col 48}{txt}Beta(medium){col 67}{res}=       0.009
{txt}Outcome{col 18}{res}: efw{col 48}{txt}R2(short){col 67}{res}=       0.000
{col 48}{txt}R2(medium){col 67}{res}=       0.253
{col 48}{txt}Var(Y){col 67}{res}=       0.420
{col 48}{txt}Var(X){col 67}{res}=      55.756
{txt}Hypothesis{col 18}{res}: Beta > 0         {col 48}{txt}Var(X_Residual){col 67}{res}=      51.242
{txt}Other Params{col 18}{res}: rybar = rxbar
{hline 80}
{col 2}{txt}cbar{col 37}rxbar(Breakdown)
{hline 80}
{col 2}{res}1.000               {col 37}78.6 %
{hline 80}
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/xd/gksdz50d7r3765bw8t_98y880000gn/T//SD40738.000000"
{txt}
{com}. log close 
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/jpmvbastos/Documents/GitHub/ColonialLegacy/Results/Review/sensitivity.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}30 Jan 2025, 17:15:35
{txt}{.-}
{smcl}
{txt}{sf}{ul off}{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/jpmvbastos/Documents/GitHub/ColonialLegacy/Results/Review/sensitivity.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}30 Jan 2025, 17:22:33

{com}. do "/var/folders/xd/gksdz50d7r3765bw8t_98y880000gn/T//SD40738.000000"
{txt}
{com}. *--- Table C : Sensitivity Analysis 
. cd "/Users/jpmvbastos/Documents/GitHub/ColonialLegacy/"
{res}/Users/jpmvbastos/Documents/GitHub/ColonialLegacy
{txt}
{com}. use "Data/ColonialEFW.dta", clear
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/xd/gksdz50d7r3765bw8t_98y880000gn/T//SD40738.000000"
{txt}
{com}. global baseline "ruggedness lpd1500s"
{txt}
{com}. 
. gen share_euro2 = share_euro
{txt}(1 missing value generated)

{com}. replace share_euro2 = .2743236 if country=="Barbados" | country=="Bahamas"
{txt}(2 real changes made)

{com}. replace share_euro2 = .9736003 if country=="New Zealand"
{txt}(1 real change made)

{com}. 
. foreach v in euro_share share_euro share_euro2 {c -(}
{txt}  2{com}.         replace `v' = `v' * 100
{txt}  3{com}. {c )-}
{txt}(58 real changes made)
(42 real changes made)
(45 real changes made)

{com}. 
. gen hiel_euro_share = efw_colonizer * euro_share
{txt}(67 missing values generated)

{com}. gen hiel_share_euro = efw_colonizer * share_euro
{txt}(21 missing values generated)

{com}. gen hiel_share_euro2 = efw_colonizer * share_euro2
{txt}(21 missing values generated)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/xd/gksdz50d7r3765bw8t_98y880000gn/T//SD40738.000000"
{txt}
{com}. * Euro Origins 
.         
. regsensitivity breakdown avg_efw share_euro2 efw_colonizer hiel_share_euro2 $w1 $model4, compare($w1) ///  Column 6
>         rybar(=rxbar) 
{res}{err}{hline 2}Break{hline 2}
{txt}{search r(1), local:r(1);}

end of do-file

{err}{hline 2}Break{hline 2}
{txt}{search r(1), local:r(1);}

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/jpmvbastos/Documents/GitHub/ColonialLegacy/Results/Review/sensitivity.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}30 Jan 2025, 17:23:50
{txt}{.-}
{smcl}
{txt}{sf}{ul off}